content/posts/2022-rss-and-atom-for-digital-minimalists.md
+++
title = "RSS and Atom for digital minimalists"
author = ["Victor Dorneanu"]
date = 2022-06-13T07:00:00+02:00
lastmod = 2022-06-13T14:16:44+02:00
tags = ["rss", "emacs"]
draft = false
+++

## Digital Minimalism {#digital-minimalism}

A few days after I have started working on this post, I begun reading Cal
Newport's [ Digital Minimalism](https://brainfck.org/#Digital%20Minimalism) book and quickly
realized how both topics interrelate to each other. But now one by one:

> Digital minimalism is a philosophy of technology use in which you focus your
> entire time on a small number of carefully selected and optimized activities to
> strongly support things you value and happily miss out everything else. -- Cal
> Newport

I think there is so much essence in this statement thus emphasizing the need for
focussed and intentional attention for our daily activities. I've finished
[reading the book](/2022/05/02/book-summary-digital-minimalism/) before releasing this post and as main takeaways
I can for sure recommend the key [principles](https://brainfck.org/#Digital%20Minimalism%20/%20Philosophy)
behind [digital minimalism](https://brainfck.org/#Digital%20Minimalism):

-   **clutter** is costly
-   **Optimization** is important
    -   deciding **which** technology to use is only the first step
    -   **how** to use it to fully extract its potential is even more important
-   **Intentionality** is satisfying
    -   intention trumps convenience
    -   about the benefits from technology chosen intentionally

I think [RSS](https://en.wikipedia.org/wiki/RSS)/[Atom](https://en.wikipedia.org/wiki/Atom_(Web_standard)) should be one of the technologies every digital **minimalist** should
have in her/her repertoire:

-   it will **de-clutter** your daily inbox of input (articles, podcasts, videos etc.)
    by allowing you to access them in a standardized, machine-readable format
-   access is completely **anonymous** and requires no registration, no e-mail subscription
    and **data consumption** is completely under your control
-   subscribing to some RSS/Atom feeds won't bring you any value unless you
    -   come up with your own system of consuming information
    -   **organize** your feeds in a way that isn't sucking up your whole attention and
        energy
    -   don't give up your good **intentions** to decide when and how to consume content
        -   don't let big companies decide for you whether content is good or not


## So-called social websites {#so-called-social-websites}

Almost everything we do in our lifes requires our mental focus and the will to
address some attention to that specific activity. Human capacity for attention
is limited and because the industry knows how to exploit human behaviour, there
is a huge competition within the **attention economy**. You're asked to subscribe to
all kind of newsletters and eventually you'll get bombarded with content you
didn't ask for.

Searching for all kind of RSS services I've stumbled upon [rss-bridge](https://github.com/RSS-Bridge/rss-bridge) which has
some critical standing on "so-called social websites":

> Your catchword is "share", but you don't want us to share. You want to keep us within your
> walled gardens. That's why you've been removing RSS links from webpages, hiding them deep
> on your website, or removed feeds entirely, replacing it with crippled or demented
> proprietary API. FUCK YOU. -- [rss-bridge](https://github.com/RSS-Bridge/rss-bridge)

Again: it's against their business to simply let you decide what to do with your content.
They're like [tech giants selling tobacco products](https://brainfck.org/#Digital%20Minimalism%20-%20Note%202).

> We want to share with friends, using open protocols: RSS, Atom, XMPP, whatever. Because no
> one wants to have your service with your applications using your API force-feeding them.
> Friends must be free to choose whatever software and service they want. --  [rss-bridge](https://github.com/RSS-Bridge/rss-bridge)

Don't try to reinvent the wheel. The technology is already there and has worked fine for decades now.

{{< tweet user="danielnemenyi" id="1470385279383089153" >}}

Also recently there have been lots of [RSS related entries on Hackernews](https://hn.algolia.com/?dateRange=all&page=0&prefix=true&query=RSS&sort=byDate&type=story).


## Media consumption {#media-consumption}

I don't like fast food neither **fast media**. I try not to consume media as soon
it's published and I don't subscribe to every possible news source - my reading
time is limited anyways.

What I instead try to do is to consume media with a **mindset of slowness**:

-   I limit my attention to the best of the best
    -   you will find currated lists of people you should follow/subscribe to
        depending of your interests
-   I commit to maximize the quality of what I consume and the conditions under
    which I do it
    -   I like to allocate dedicated time for reading (and watching videos!)
    -   A distraction free environment is essential for me to consume the content
        and extract what's most important for me
        -   the chosen location should support me in giving my full attention to the
            reading
    -   I usually download (web) articles in advance and send them to my e-reader
        using [getpocket.com](https://getpocket.com) (also check out my previous blog entry for [getpocket
        best practices](/2021/09/01/inbox-zero-using-getpocket/))
    -   I aggregate news content/feeds in one place
        -   most of the time I use [Emacs](https://brainfck.org/#Emacs) along with [elfeed](https://github.com/skeeto/elfeed) to decide
            which content I'll send to the reading queue (more on my Emacs setup
            in a separate post)

Besides adopting [slow media](https://en.wikipedia.org/wiki/Slow_media) and while I'm not against social media I do think you can extract
value out of it if used the proper way. Also [Cal Newport](https://calnewport.com) suggests using it like a professional:

-   extract most possible value while avoiding much of the low-value distraction
    (ads, related content, comments) the services deploy to lure users into
    compulsive [behaviour](https://brainfck.org/#Behavioural%20Addiction%20)
-   use **thresholding** (only see tweets with X likes/re-tweets) and other mechanisms
    for relevant content
-   show links with most upvotes/comments
    -   I can recommend [hnrss](https://hnrss.github.io/) for HN


## Really Simple Stuff {#really-simple-stuff}

RSS (Really Simple Syndication) and Atom feeds have been for decades the best way to consume
content and the let the consumer decide **when** to do so.


### Format {#format}

I don't care if it's JSON, [RSS](https://en.wikipedia.org/wiki/RSS) or [ATOM](https://en.wikipedia.org/wiki/Atom_(Web_standard)). It should be a standard, parseable
format! That's what I'm asking for. Even worse: There are sites without any RSS
feeds that have a public API for fetching things. Please, stop doing so! There
is nothing wrong with RSS/ATOM and standardization is good.

In the following sections I'll give some advice how you can get RSS/ATOM feeds from
well known services.
