org/blog.org
**** Social Media
The social media list is definitely not complete. I will just list the ones I use from time
to time.

- *Youtube*

  Fortunately YouTube still has RSS feeds. You just need the ~channel_id~ of a
  channel and use this URL to actually get the feeds:

  #+begin_src
  https://youtube.com/feeds/videos.xml?channel_id=<channel_id>
  #+end_src

  That's it. But wait. Sometimes you don't have a ~channel_id~ and need to find it
  out. In this case have a look at source of that specific Youtube page and extract
  the ~channel_id~ from there as described [[https://stackoverflow.com/questions/14366648/how-can-i-get-a-channel-id-from-youtube][here]].

- *Twitter*
  - [[https://nitter.net][nitter.net]]
  - [[https://github.com/RSS-Bridge/rss-bridge][rss-bridge]]
- *Reddit*

  While Reddit always had a high volume of content posted on daily basis, meanwhile I
  only check for the top posts this month ([[https://www.reddit.com/r/golang/top/?t=week][example: top posts in /r/golang]]). I also
  like reddit for the [[https://www.reddit.com/wiki/rss][RSS features]] it implements on a quite granular level:
  - [[http://www.reddit.com/.rss][reddit front page]]
  - [[http://www.reddit.com/r/netsec/.rss][RSS feeds for a subreddit]]
  - [[http://www.reddit.com/user/cyneox/.rss][RSS feeds for a specific user]]
  - [[https://www.reddit.com/domain/blog.dornea.nu/.rss][submissions for a specific domain]]
- *LinkedIn*

  Currently LinkedIn has no feeds at all. But I'm already working on a solution
  which will allow an user to subscribe (of course, via RSS/Atom) to all updates
  and posts within his/her business network on LinkedIn.
**** Engineering
- *Github*

  With Github it's quite easy to stay up-to-date with activities within a repository. Take the
  project page and just append ~/releases.atom~, ~/tags.atom/~ or ~/commits/master.atom~. Example:
  - [[https://github.com/golang/go/releases.atom][releases]]
  - [[https://github.com/golang/go/tags.atom][tags]]
  - [[https://github.com/golang/go/commits/master.atom][commits (master branch)]]
- *Gitlab*

  Some examples:
  - [[https://gitlab.com/vdorneanu/widdly/-/tags?format=atom][tags]]
  - [[https://gitlab.com/vdorneanu/widdly/-/commits/master?format=atom][commits]]
**** Podcasts
I mainly use [[https://player.fm/][player.fm]] for listening to podcasts and finding new content.
However, I use Emacs/elfeed to make a pre-selection of episodes because it's
really fast and convenient to integrate within my daily workflow. Using the
mobile app instead is time consuming and I'm always distracted by something
else. As I've mentioned before: Use technology wisely and come up with a
workflow that doesn't distract you from the real task.

In the case of player.fm you can easily export your feeds in [[https://en.wikipedia.org/wiki/OPML][OPML]] format:
#+begin_example
https://player.fm/<username>/subs.opml
#+end_example

This is how it looks like:

#+begin_src xml
<?xml version="1.0" encoding="UTF-8"?>
<opml version='1.0'>
<head>
<title>Player FM Feeds from All</title>
<dateCreated>June 08, 2022 19:29</dateCreated>
<dateModified>June 08, 2022 19:29</dateModified>
</head>
<body>
<outline text="extra 3  HQ" type="rss" xmlUrl="https://www.ndr.de/fernsehen/sendungen/extra_3/video-podcast/extradrei196_version-hq.xml"  htmlUrl="https://www.ndr.de/fernsehen/sendungen/extra_3/video-podcast/index.html" />
<outline text="The Tim Ferriss Show" type="rss" xmlUrl="https://rss.art19.com/tim-ferriss-show"  htmlUrl="https://tim.blog/podcast" />
<outline text="Zur Diskussion - Deutschlandfunk" type="rss" xmlUrl="https://www.deutschlandfunk.de/zur-diskussion-102.xml"  htmlUrl="https://www.deutschlandfunk.de/zur-diskussion-100.html" />
<outline text="Update - Deutschlandfunk Nova" type="rss" xmlUrl="https://www.deutschlandfunknova.de/podcast/update"  htmlUrl="https://www.deutschlandfunknova.de/podcasts/download/update" />
....
#+end_src

I then used some Python foo to parse the XML file and extract ~xmlUrl~ and ~text~
attributes which were then used to generate an ORG file with all the podcasts
feeds.
**** Services
Below you'll find a list of (paid/free) services/tools which further enhance
the RSS/Atom feed subscription feature.

- [[https://github.com/RSS-Bridge/rss-bridge][rss-bridge]]
  #+begin_quote
  RSS-Bridge is a PHP project capable of generating RSS and Atom feeds for websites that don't have one. It can be used on webservers or as a stand-alone application in CLI mode.
  #+end_quote
  - https://feed.eugenemolotov.ru/
  - https://college.kre.dp.ua/rss/
  - https://rss.searchdaddy.ie/
  - https://rss.garichankar.com/
- [[https://brutalist.report/][brutalist.report]]
  - delivers daily headlines without bullshit
  - you'll get ads-free headlines from
    - Hackernews
    - The Verge
    - Slashdot
    - ArsTechnica
    - The Register
    - Protocol
    - Linux Weekly News
    - The New York Times
    - NPR
    - and many others
- [[https://about.elink.io/rss-feed-reader][elink.io RSS feed reader]]
  #+begin_quote
  Read and curate content with elink's robust RSS feed reader. elink allows you to easily stay informed by retrieving the latest content from the sites you are interested in. Simply grab the RSS feeds from the sites you love and we will display them for you to read articles or create content.
  #+end_quote
- [[http://fetchrss.com/][fetchrss.com]]
  #+begin_quote
  First of all it's an online RSS feed generator. This service allows you to
  create RSS feed out of almost any web page. Your only task is to provide us
  with target URL and point on desired blocks in our visual RSS builder.
  #+end_quote
  I really liked the *visual RSS builder* functionality which allows you for which
  parts of a page you'd like to get RSS feeds. Also the auto-update feature lets you
  know if a page has changed.
- [[https://rss.app][rss.app]]
  #+begin_quote
  Aggregate and curate your favorite websites by turning them into auto-updated RSS feeds. Fastest RSS finder and creator on the market.
  #+end_quote
- [[https://sr.ht/~ghost08/ratt/][ratt]]
  #+begin_quote
  RSS all the things: ratt is a tool for converting websites to rss/atom feeds. It uses config files which define the extraction of the feed data by using css selectors, or Lua script.
  #+end_quote
- [[http://granary.io/][granary.io]]
  #+begin_quote
  Fetches and converts data between social networks, HTML and JSON with microformats2, ActivityStreams 1 and 2, Atom, RSS, JSON Feed, and more
  #+end_quote
  What I do *not* like about it: The OAuth tokens are used as URL parameters. From a Security perspective that really sucks.

- [[https://kill-the-newsletter.com/][kill-the-newsletter.com]]

  Converts Email newsletters into Atom feeds. Definitely one of my favourite ones.

