content/posts/2022-rss-and-atom-for-digital-minimalists.md


### Social Media {#social-media}

The social media list is definitely not complete. I will just list the ones I use from time
to time.

-   **Youtube**

    Fortunately YouTube still has RSS feeds. You just need the `channel_id` of a
    channel and use this URL to actually get the feeds:

    ```nil
        https://youtube.com/feeds/videos.xml?channel_id=<channel_id>
    ```

    That's it. But wait. Sometimes you don't have a `channel_id` and need to find it
    out. In this case have a look at source of that specific Youtube page and extract
    the `channel_id` from there as described [here](https://stackoverflow.com/questions/14366648/how-can-i-get-a-channel-id-from-youtube).

-   **Twitter**
    -   [nitter.net](https://nitter.net)
    -   [rss-bridge](https://github.com/RSS-Bridge/rss-bridge)
-   **Reddit**

    While Reddit always had a high volume of content posted on daily basis, meanwhile I
    only check for the top posts this month ([example: top posts in /r/golang](https://www.reddit.com/r/golang/top/?t=week)). I also
    like reddit for the [RSS features](https://www.reddit.com/wiki/rss) it implements on a quite granular level:

    -   [reddit front page](http://www.reddit.com/.rss)
    -   [RSS feeds for a subreddit](http://www.reddit.com/r/netsec/.rss)
    -   [RSS feeds for a specific user](http://www.reddit.com/user/cyneox/.rss)
    -   [submissions for a specific domain](https://www.reddit.com/domain/blog.dornea.nu/.rss)
-   **LinkedIn**

    Currently LinkedIn has no feeds at all. But I'm already working on a solution
    which will allow an user to subscribe (of course, via RSS/Atom) to all updates
    and posts within his/her business network on LinkedIn.


### Engineering {#engineering}

-   **Github**

    With Github it's quite easy to stay up-to-date with activities within a repository. Take the
    project page and just append `/releases.atom`, `/tags.atom/` or `/commits/master.atom`. Example:

    -   [releases](https://github.com/golang/go/releases.atom)
    -   [tags](https://github.com/golang/go/tags.atom)
    -   [commits (master branch)](https://github.com/golang/go/commits/master.atom)
-   **Gitlab**

    Some examples:

    -   [tags](https://gitlab.com/vdorneanu/widdly/-/tags?format=atom)
    -   [commits](https://gitlab.com/vdorneanu/widdly/-/commits/master?format=atom)


### Podcasts {#podcasts}

I mainly use [player.fm](https://player.fm/) for listening to podcasts and finding new content.
However, I use Emacs/elfeed to make a pre-selection of episodes because it's
really fast and convenient to integrate within my daily workflow. Using the
mobile app instead is time consuming and I'm always distracted by something
else. As I've mentioned before: Use technology wisely and come up with a
workflow that doesn't distract you from the real task.

In the case of player.fm you can easily export your feeds in [OPML](https://en.wikipedia.org/wiki/OPML) format:

```text
https://player.fm/<username>/subs.opml
```

This is how it looks like:

```xml
<?xml version="1.0" encoding="UTF-8"?>
<opml version='1.0'>
<head>
<title>Player FM Feeds from All</title>
<dateCreated>June 08, 2022 19:29</dateCreated>
<dateModified>June 08, 2022 19:29</dateModified>
</head>
<body>
<outline text="extra 3  HQ" type="rss" xmlUrl="https://www.ndr.de/fernsehen/sendungen/extra_3/video-podcast/extradrei196_version-hq.xml"  htmlUrl="https://www.ndr.de/fernsehen/sendungen/extra_3/video-podcast/index.html" />
<outline text="The Tim Ferriss Show" type="rss" xmlUrl="https://rss.art19.com/tim-ferriss-show"  htmlUrl="https://tim.blog/podcast" />
<outline text="Zur Diskussion - Deutschlandfunk" type="rss" xmlUrl="https://www.deutschlandfunk.de/zur-diskussion-102.xml"  htmlUrl="https://www.deutschlandfunk.de/zur-diskussion-100.html" />
<outline text="Update - Deutschlandfunk Nova" type="rss" xmlUrl="https://www.deutschlandfunknova.de/podcast/update"  htmlUrl="https://www.deutschlandfunknova.de/podcasts/download/update" />
....
```

I then used some Python foo to parse the XML file and extract `xmlUrl` and `text`
attributes which were then used to generate an ORG file with all the podcasts
feeds.


### Services {#services}

Below you'll find a list of (paid/free) services/tools which further enhance
the RSS/Atom feed subscription feature.

-   [rss-bridge](https://github.com/RSS-Bridge/rss-bridge)

    > RSS-Bridge is a PHP project capable of generating RSS and Atom feeds for websites that don't have one. It can be used on webservers or as a stand-alone application in CLI mode.

    -   <https://feed.eugenemolotov.ru/>
    -   <https://college.kre.dp.ua/rss/>
    -   <https://rss.searchdaddy.ie/>
    -   <https://rss.garichankar.com/>
-   [brutalist.report](https://brutalist.report/)
    -   delivers daily headlines without bullshit
    -   you'll get ads-free headlines from
        -   Hackernews
        -   The Verge
        -   Slashdot
        -   ArsTechnica
        -   The Register
        -   Protocol
        -   Linux Weekly News
        -   The New York Times
        -   NPR
        -   and many others
-   [elink.io RSS feed reader](https://about.elink.io/rss-feed-reader)

    > Read and curate content with elink's robust RSS feed reader. elink allows you to easily stay informed by retrieving the latest content from the sites you are interested in. Simply grab the RSS feeds from the sites you love and we will display them for you to read articles or create content.
-   [fetchrss.com](http://fetchrss.com/)

    > First of all it's an online RSS feed generator. This service allows you to
    > create RSS feed out of almost any web page. Your only task is to provide us
    > with target URL and point on desired blocks in our visual RSS builder.

    I really liked the **visual RSS builder** functionality which allows you for which
    parts of a page you'd like to get RSS feeds. Also the auto-update feature lets you
    know if a page has changed.
-   [rss.app](https://rss.app)

    > Aggregate and curate your favorite websites by turning them into auto-updated RSS feeds. Fastest RSS finder and creator on the market.
-   [ratt](https://sr.ht/~ghost08/ratt/)

    > RSS all the things: ratt is a tool for converting websites to rss/atom feeds. It uses config files which define the extraction of the feed data by using css selectors, or Lua script.
-   [granary.io](http://granary.io/)

    > Fetches and converts data between social networks, HTML and JSON with microformats2, ActivityStreams 1 and 2, Atom, RSS, JSON Feed, and more

    What I do **not** like about it: The OAuth tokens are used as URL parameters. From a Security perspective that really sucks.

-   [kill-the-newsletter.com](https://kill-the-newsletter.com/)

    Converts Email newsletters into Atom feeds. Definitely one of my favourite ones.
