org/blog.org
*** Distribute content
You can also use RSS to distribute to share your content to social media. Using workflows
provided by services like [[https://zapier.com/][zapier]] or [[https://ifttt.com/][ifttt]] you can easily use RSS feeds to automatically
post and share new content via Twitter, Facebook, LinkedIn and other major social media
platforms.

You can use [[https://gohugo.io/][hugo]] (or any static site generator) to generate RSS/Atom feeds after
you've added your content. Some while ago I've setup a PoC
([[https://github.com/dorneanu/feeds][github.com/dorneanu/feeds]]) to automatically share content to Twitter and
LinkedIn using hugo. Let's have a look at this [[https://github.com/dorneanu/feeds/blob/main/content/feeds/2021-simple-post.md][sample post]] (in Markdown):

#+begin_src markdown
+++
title = "Simple post"
author = ["Victor Dorneanu"]
lastmod = 2021-10-04T19:51:54+02:00
tags = ["twitter", "linkedin"]
draft = false
weight = 2005
posturl = "https://heise.de"
+++

Some text here and there.

-   text here
-   text [some link](https://google.de)
#+end_src

This post is tagged with ~twitter~ and ~linkedin~. Accordingly this post should be part of
- [[https://feeds.brainfck.org/tags/linkedin/index.xml][the LinkedIn RSS feed list]]
- [[https://feeds.brainfck.org/tags/twitter/index.xml][the Twitter RSS feed list]]

Using hugo's [[https://gohugo.io/content-management/front-matter/][front matter]] you can add specific metadata like ~posturl~. Let's have a look how
the correspondig RSS entry looks like:

#+begin_src xml
<item>
<title>Simple post</title>
<link>http://feeds.brainfck.org/feeds/2021-simple-post/</link>
<pubDate>Mon, 04 Oct 2021 19:51:54 +0200</pubDate>
<guid>http://feeds.brainfck.org/feeds/2021-simple-post/</guid>
<description>Some text here and there. text here text some link </description>
<postUrl>https://heise.de</postUrl>
<htmlContent><p>Some text here and there.</p> <ul> <li>text here</li> <li>text <a href="https://google.de">some link</a></li> </ul> </htmlContent>
<plainContent>Some text here and there. text here text some link </plainContent>
</item>
#+end_src

Now you can use this mechanism to automatically share content to LinkedIn/Twitter
from a specific taxonomy RSS feed.

**** zapier

I like [[https://zapier.com][zapier]] for its intuitive simplicity for creating so called *zaps*. A zap is an integration
between one service (e.g. Twitter/LinkedIn) and a specific event (new item was added to a RSS feed).
This way you can automatically share content via social media services using RSS feeds.


#+begin_src plantuml :file ../static/posts/img/2022/rss/zapier-workflow.png :exports none
@startuml
actor User
box "Hugo" #LightBlue
    participant hugo as "Hugo"
    participant feeds as "Feeds"
end box

box "Zapier"
    participant zap as "Zap"
end box

box "Social Media" #LightGreen
    participant twitter as "Twitter"
    participant linkedin as "LinkedIn"
end box

User -> hugo: Uploads new post
hugo -> feeds: Generate new feeds

zap -> feeds: Fetch new feed entry
zap -> zap: Extract fields from feed entry

zap -> twitter: Send new tweet
zap -> linkedin: Send new update
@endum
#+end_src


This is the overall workflow:
#+html: {{< gbox src="/posts/img/2022/rss/zapier-workflow.png" title="RSS workflow using Hugo and Zapier" caption="RSS Workflow" pos="left" >}}

Chose which RSS to trigger events
#+html: {{< gbox src="/posts/img/2022/rss/zapier_rss_trigger.png" title="RSS Trigger" caption="RSS Trigger" pos="left" >}}

And configure how your new LinkedIn share update should look like
#+html: {{< gbox src="/posts/img/2022/rss/zapier_send_to_linkedin.png" title="Send new content to LinkedIn as a new share update" caption="" pos="left" >}}

This workflow has quite many steps and requires some ~hugo~ knowledge. You're also
limited by the maximal number of zaps you can trigger each month and the number
of services you'd like to sent your (RSS) content to. All these limitations lead
to a custom implementation (in {{{zk(Golang,Golang)}}}) which I will release (as
a web service) soon.
*** Conclusion
RSS/Atom has been on of the standardized ways how applications can retrieve content from each other.
It doesn't require authentication and it's way simpler to implement than a REST API. I think it was
like 2 years ago when I started to reduce my content consumption behaviour and started looking for a
simple way to do it when I want it and in the way I like it. I don't have to visit every single page
nor do I have to go through my emails and skip promotions/ads before the real content is revealed.
With modern RSS/Atom readers these days you can easily filter and label articles which will definitely
improve your daily newsflow and reading habits.

You can find this blogs RSS feed at [[https://blog.dornea.nu/feed.xml][blog.dornea.nu/feed.xml]]. I've also exported my current RSS subscription
list to [[https://gist.github.com/dorneanu/c3db1683e68137ff84775e87bd225ae4][this gist]].

